[
  {
    "Id": 1,
    "Tab": "Index",
    "Title": "Who I Am",
    "img": "~/images/573.jpeg",
    "Description": "Welcome to my web portfolio! My name is Adam Clifton. I am an ambitious professional aspiring to develop a long-term career in the field of technology. I have the proven ability to work well under pressure, independently or as part of a team. I communicate effectively and personably with both coworkers and clients.",
    "BulletList": []
  },
  {
    "Id": 2,
    "Tab": "Index",
    "Title": "Who I Am",
    "img": "~/images/573.jpeg",
    "Description": "I am a current student at Arizona State University developing software engineering skills, and I continue to build on my knowledge of programming logic, design process and patterns, structure implementation, software/system analysis, agile and scrum workflow, and quality assurance.",
    "BulletList": []
  },
  {
    "Id": 3,
    "Tab": "Index",
    "Title": "Who I Am",
    "img": "~/images/573.jpeg",
    "Description": "I have a sincere interest and passion for technology and am committed to expanding my knowledge and expertise in the ever-evolving field.",
    "BulletList": []
  },
  {
    "Id": 4,
    "Tab": "Index",
    "Title": "Education",
    "img": null,
    "Description": "I am pursuing a Bachelor's of Science in Software Engineering at Arizona State University's Ira A. Fulton Schools of Engineering, and am on track to graduate May 2021.",
    "BulletList": []
  },
  {
    "Id": 5,
    "Tab": "Index",
    "Title": "Professional Experience",
    "img": null,
    "Description": "I worked in legal field at the United States Department of Justice for 10 years in various capacities.  In January 2017, I began my journey to move toward a career change into software engineering.",
    "BulletList": []
  },
  {
    "Id": 6,
    "Tab": "Index",
    "Title": "Skillsets",
    "img": null,
    "Description": "I have been developing and improving skills in programming logic, OOP, data structures and algorithms, design process and patterns, structure implementation, adhering to SDLC and MVC principles, software/system analysis, agile and scrum process flow, and quality assurance.",
    "BulletList": []
  },
  {
    "Id": 7,
    "Tab": "Index",
    "Title": "Skillsets",
    "img": null,
    "Description": "I am continuing to use and gain proficiency in Java, C, C++, and C# languages, and use with query languages in MySQL and Microsoft SQL Server. Moreover, I am working on growing my proficiency integrating it all with Client-facing frameworks ASP.NET, XML, HTML, and Javascript.",
    "BulletList": []
  },
  {
    "Id": 8,
    "Tab": "Index",
    "Title": "Projects",
    "img": null,
    "Description": "I have worked on a variety of school-related projects and personal projects to improve my development skills. In fact, you're looking at one of those projects now :)",
    "BulletList": []
  },
  {
    "Id": 9,
    "Tab": "Experience",
    "Title": "Professional Experience",
    "img": null,
    "Description": "I have gained experience learning from and interacting with other professionals in the legal field for 10 years.  Here, I learned valuable skills in terms of time and resource management, education and training, communication, and troubleshooting techniques. I am now pursuing the next adventure and challenge in my professional career in the field of technology and software.",
    "BulletList": []
  },
  {
    "Id": 10,
    "Tab": "Experience",
    "Title": "LeadLA",
    "img": null,
    "Description": "",
    "BulletList": [
      "Provide direct administrative and legal support services for attorneys and support staff in the fast-paced criminal division. Examine and prepare: technical legal documents, trial preparation and execution, maintain supplies and equipment, records, office hardware and software, and conduct office automation.",
      "Maintain projects and analyze electronic databases and directories: CaseMap, LIONS, CaseView, Microsoft Access, Microsoft SharePoint, IPRO, and Microsoft Excel.  Well-versed in Microsoft Office and Adobe Acrobat Professional. Assist in special work projects: bolster software technology improvements including the facilitation of USAfx, a cloud-sharing service. Provide advice and assistance on processing methods and improvements, file design, organization, access methods, security requirement, and associated software and utility programs.",
      "Exercise sound, working knowledge of unit priorities, goals and objectives, and work across boundaries to cooperate with team members, clients, managers, groups, and organizations to achieve objectives.  Perform hardware and software installation and maintenance and provide user support of known hardware and software systems, diagnose and resolve problems in response to reported co-worker or attorney incidents."
    ]
  },
  {
    "Id": 11,
    "Tab": "Experience",
    "Title": "Paralegal",
    "img": null,
    "Description": "",
    "BulletList": [
      "Provide technical, advisory and support assistance to four staff attorneys whose caseload included personal injury, bankruptcy, insurance claims, and real estate.  Examine and prepare legal documents: settlement agreements, plea agreements, demand letters, exhibit assembly, affidavits, motions, discovery, lien reductions and correspondence. Handle all support services: calendaring, docketing, filing, case, communications services and changes, teleconferencing, and provide support in information management and maintaining network architecture and infrastructure.",
      "Manage all office equipment, including installing, configuring, troubleshooting, and maintaining customer hardware and software, and resolving any hardware/software interface and interoperability problems.  Assist in monitoring functionality, security, and integrity of internet services.",
      "Creation and management of in-house database for case information:  two-hundred fifty (250) active cases.  Implement policies and procedures to ensure information system reliability. Direct interaction with clients, opposing counsel, medical providers, claims examiners and agents, expert and lay witnesses."
    ]
  },
  {
    "Id": 12,
    "Tab": "Experience",
    "Title": "ContLA",
    "img": null,
    "Description": "",
    "BulletList": [
      "Provide administrative and legal support services for attorneys and support staff in the civil division at the United States Attorney's Office in areas which include medical malpractice, defensive tort actions, bankruptcy and affirmative civil enforcement. Handle mail, records, travel, technology software and hardware assistance, communication services, and conference calls.",
      "Analyze and organize large discovery projects, medical releases and subpoenas, and a wide variety of legal pleadings and documents. Research with a variety of legal sources: Westlaw, Lexis-Nexis, public records, court records, profile background checks.",
      "Develop guides: IPRO E-Scan-IT and IPRO Viewer for internal use."
    ]
  },
  {
    "Id": 13,
    "Tab": "Experience",
    "Title": "Student",
    "img": null,
    "Description": "",
    "BulletList": [
      "Provide administrative and support services for up to 15 attorneys and nine support staff.",
      "Office automation: technology hardware, software, and equipment, Microsoft Office, mail production, reproduction, records, and communication software services for reception.",
      "Administrative support activities: clerical tasks, office inventory management, reorganization, space management, case information management, and courier services."
    ]
  }


]