[
  {
    "Id": 1,
    "Tab": "Index",
    "Title": "Who I Am",
    "Description": "Welcome to my web portfolio! My name is Adam Clifton. I started building personal computers in 2013 and realized not only do I have an interest in computing, technology, and software, but I also have a knack for it.",
    "BulletList": []
  },
  {
    "Id": 22,
    "Tab": "Index",
    "Title": "Who I Am",
    "Description": "In January 2017, despite a successful and rewarding 10 years as a legal professional at the United States Attorney's Office, I decided to pursue a degree and career in Software Engineering. I am currently in my Senior Year at Arizona State University's Ira A. Fulton School of Engineering. I am on track to graduate with a Bachelor of Science degree in Software Engineering in April 2021.",
    "BulletList": []
  },
  {
    "Id": 2,
    "Tab": "Index",
    "Title": "Education",
    "Description": "I am pursuing a Bachelor of Science degree in Software Engineering at Arizona State University's Ira A. Fulton Schools of Engineering, and am on track to graduate May 2021.",
    "BulletList": []
  },
  {
    "Id": 3,
    "Tab": "Index",
    "Title": "Professional Experience",
    "Description": "Working for the U.S. Attorney's Office, I developed a solid work ethic. I gained skills in time management, communication, and helped streamline processes. I received on-the-job training in and worked regularly with various software and systems. I have been told I am hard-working, teachable, and innovative. I am innately curious in learning how things work, and like to find new, more efficient ways of doing things. This is part of why I turned to a career in the ever-evolving field of software engineering.",
    "BulletList": []
  },
  {
    "Id": 4,
    "Tab": "Index",
    "Title": "Skillsets",
    "Description": "As a Software Engineering student at ASU, I gained significant knowledge and practical skills in programming logic, design processes and patterns, structure implementation, adhering to SDLC and MVC principles, software/ system analysis, Agile and SCRUM workflow, unit testing, and quality assurance. I am proficient in Java, C, C++, and C# languages, as well as SQL. Moreover, I am learning how to integrate it all with client-facing frameworks like ASP.NET, JavaScript, and HTML.",
    "BulletList": []
  },
  {
    "Id": 5,
    "Tab": "Index",
    "Title": "Projects",
    "Description": "I have worked on a variety of school-related projects and personal projects to improve my development skills. In fact, you're looking at one of those projects now :)",
    "BulletList": []
  },
  {
    "Id": 6,
    "Tab": "Experience",
    "Title": "Professional Experience",
    "Description": "I worked in legal field at the United States Department of Justice for 10 years in various capacities. In January 2017, I began my journey to move toward a career change into software engineering.",
    "BulletList": []
  },
  {
    "Id": 7,
    "Tab": "Experience",
    "Title": "LeadLA",
    "img": null,
    "Description": "",
    "BulletList": [
      "Deliver training and guidance to section staff.  Exercise sound, working knowledge of unit priorities, goals and objectives, and work across boundaries to cooperate with internal and external groups to achieve objectives.  ",
      "Maintain projects and analyze electronic databases and directories: CaseMap, LIONS, CaseView, Microsoft Access, Microsoft SharePoint, IPRO, and Microsoft Excel.  Proficient with Microsoft Office and Adobe Acrobat Professional. Assist in special work projects: bolster software technology improvements including the facilitation of USAfx, a cloud-sharing service. Perform hardware and software installation and maintenance and provide user support of known hardware and software systems, diagnose, and resolve problems in response to reported colleague incidents",
      "Provide direct legal administrative services in the fast-paced criminal division.  Includes prepare and review of technical legal documents, trial materials, maintain supplies and equipment, records, office hardware and software. "
    ]
  },
  {
    "Id": 8,
    "Tab": "Experience",
    "Title": "Paralegal",
    "Description": "",
    "BulletList": [
      "Creation and management of in-house database for case information:  two-hundred fifty (250) active cases.  Implement policies and procedures to ensure information system reliability. Coordinate with clients, opposing counsel, medical providers, claims examiners and agents, expert, and lay witnesses.",
      "Provide technical, advisory and support assistance to four staff attorneys whose caseload included personal injury, bankruptcy,  insurance claims, and real estate.  Examine and prepare legal documents, handle support service functions, and provide support in information management and maintaining network architecture and infrastructure.",
      "Manage all office equipment, including installing, configuring, troubleshooting, and maintaining customer hardware and software, and resolving any hardware/software interface and interoperability problems.  Assist in monitoring functionality, security, and integrity of internet services."
    ]
  },
  {
    "Id": 9,
    "Tab": "Experience",
    "Title": "ContLA",
    "Description": "",
    "BulletList": [
      "Provide legal administrative services for attorneys and support staff in the civil division at the United States Attorney's Office in areas of medical malpractice, defensive torts, bankruptcy, and affirmative civil enforcement. Handle office automation and technology software and hardware assistance.",
      "Analyze and organize large discovery projects, medical releases and subpoenas, and a wide variety of legal pleadings and documents. Research with a variety of legal sources: Westlaw, Lexis-Nexis, public records, court records, profile background checks.",
      "Develop guides: IPRO E-Scan-IT and IPRO Viewer for internal use."
    ]
  },
  {
    "Id": 10,
    "Tab": "Experience",
    "Title": "Student",
    "Description": "",
    "BulletList": [
      "Provide support services for up to 15 attorneys and nine support staff.",
      "Office automation: technology hardware, software, and equipment, Microsoft Office, mail production, reproduction, records, and communication software services for reception.",
      "Administrative support: clerical tasks, office inventory management, reorganization, space management, case information management, and courier services."
    ]
  },
  {
    "Id": 11,
    "Tab": "Projects",
    "Title": "Projects-Body",
    "Description": "Coursework from ASU and personal projects have allowed me to develop skills in diverse areas with a variety of design techniques. Below are some notable projects and skills acquired:",
    "BulletList": []
  },
  {
    "Id": 12,
    "Tab": "Projects",
    "Title": "webp-left",
    "Description": "",
    "BulletList": [
      "A web-based portfolio to highlight resume, skills and attributes",
      "Purpose: Build an online portfolio with common web development tools and languages",
      "Implemented designed and built by me with ASP.NET"
    ]
  },
  {
    "Id": 13,
    "Tab": "Projects",
    "Title": "webp-right",
    "Description": "",
    "BulletList": [
      "Fundamentals and development with ASP.NET",
      "Development with HTML and CSS",
      "Development with Javascript",
      "Fundamental use of MVC",
      "C# and .NET integration with web-based applications",
      "Strengthened source control use with Git and Github"
    ]
  },
  {
    "Id": 14,
    "Tab": "Projects",
    "Title": "dmp-left",
    "Description": "",
    "BulletList": [
      "A distributed media player with Java and C++",
      "Purpose: Develop a distributed application with proper separation of client and server",
      "Implemented a GUI using server/ client remote proctor service"
    ]
  },
  {
    "Id": 15,
    "Tab": "Projects",
    "Title": "dmp-right",
    "Description": "",
    "BulletList": [
      "Strengthened development with Java OOP",
      "Development with Sockets, Threads, and Protocols",
      "Skeleton/ stub creation for client/ server",
      "Development with C++",
      "Development with JSON and XML for storage and build files",
      "Building JSON serializer/ deserializer in Java and C++",
      "Development using Debian/ Ubuntu Linux environment",
      "Use of tools such as curlpp and ant",
      "Third-Party API integration: OMDb API"
    ]
  },
  {
    "Id": 16,
    "Tab": "Projects",
    "Title": "das-left",
    "Description": "",
    "BulletList": [
      "Implemented a console database application with SQL and Java",
      "Purpose: Develop skills with SQL and integration with common OOP language client",
      "Team-Based, Agile/SCRUM workflow"
    ]
  },
  {
    "Id": 17,
    "Tab": "Projects",
    "Title": "das-right",
    "Description": "",
    "BulletList": [
      "Strengthened development with Java OOP",
      "Development with SQL, using MySQL command line client",
      "Integration tools: JDBC and MySql Connector",
      "Design modelling with UML, EER and Relational diagrams",
      "Script implementation to instantiate and populate databases",
      "Use of common sequal command queries (select, update, drop table, create table, insert into, alter table, join variations, count, etc.)"
    ]
  },
  {
    "Id": 18,
    "Tab": "Projects",
    "Title": "dps-left",
    "Description": "",
    "BulletList": [
      "Implemented an console-based simulated scenario where heroes and villains fight it out for world domination",
      "Purpose: Use design patterns with proper separation and testing",
      "Gang of Four Design (GoF) Patterns with Java"
    ]
  },
  {
    "Id": 19,
    "Tab": "Projects",
    "Title": "dps-right",
    "Description": "",
    "BulletList": [
      "Strengthened development with Java OOP",
      "Development with GoF design patterns: decorator, factory and mediator",
      "Integration tool: Gradle",
      "Unit Testing tools: JUnit (path/ branch coverage), TravisCI, Checkstyle, and Spotbugs",
      "Code review techniques: static analysis, white/ black-box unit testing",
      "Design modelling with UML"
    ]
  },
  {
    "Id": 20,
    "Tab": "Projects",
    "Title": "manfui-left",
    "Description": "",
    "BulletList": [
      "Implemented and mocked manufacturing UI and system file tree",
      "Purpose: Learn the basics of WPF and Xamarin XAML to create UI applications",
      "Implemented with C#, WPF and Xamarin"
    ]
  },
  {
    "Id": 21,
    "Tab": "Projects",
    "Title": "manfui-right",
    "Description": "",
    "BulletList": [
      "Development with C#",
      "Development with WPF, and XAML",
      "Fundmental use of MVC to ensure proper separation",
      "Static and Dynamic UI creation with XAML binding"
    ]
  },
  {
    "Id": 22,
    "Tab": "Projects",
    "Title": "capstone-left",
    "Description": "",
    "BulletList": [
      "Implemented a web application used as a training tool to enhance Agile workflow team development",
      "Purpose: Develop a web application in an Agile environment with team and sponsors",
      "Explore new technologies for developmental skill growth",
      "Implemented with ReactJS and Node Express, integrating AWS and Heroku web-hosting service",
      "Team-based, Agile/SCRUM workflow"
    ]
  },
  {
    "Id": 23,
    "Tab": "Projects",
    "Title": "capstone-right",
    "Description": "",
    "BulletList": [
      "Development with Javascript/ReactJS frontend and Node Express backend",
      "Integration Tools: AWS CDN and Heroku web-hosting",
      "Testing Tools: Enzyme, Jest, and Jacoco",
      "Fundamental use of common web application tools NPM, Yarn and Babel",
      "Team-oriented communication and skills with regular stand-ups, weekly planning, refinement, and retrospective meetings with sponsors"
    ]
  }
]